app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY id ASC LIMIT 20
---
  def index
    @products = Products.order('id ASC').limit(20)

SELECT `products`.* FROM `products` WHERE `products`.`id` = 'id' LIMIT 1
---
  def show
    @product = Products.find(params[:id])

SELECT `products`.* FROM `products` WHERE (title LIKE('%%')) LIMIT 20
---
  def search
    @products = Products.where('title LIKE(?)', "%#{params[:keyword]}%").limit(20)