app/controllers/reviews_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def new
    @review = Review.new
    @product = Product.find(params[:product_id])